Revit 2027 API
DoubleClickOptions.GetDoubleClickOptions Method
 Returns the current user's DoubleClickOptions.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DoubleClickOptions GetDoubleClickOptions()
Public Shared Function GetDoubleClickOptions As DoubleClickOptions
public:
static DoubleClickOptions^ GetDoubleClickOptions()
static member GetDoubleClickOptions : unit -> DoubleClickOptions
Return Value
DoubleClickOptions
 The DoubleClickOptions for the current user.
See Also
Reference
DoubleClickOptions Class
Autodesk.Revit.UI Namespace